unix_hardlink_symlink.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-26 Thu 00:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hardlink и symlink в UNIX</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Linux" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">hardlink и symlink в UNIX</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org1db4fa2">1. Отличия hardlink от symlink</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1db4fa2" class="outline-2">
<h2 id="org1db4fa2"><span class="section-number-2">1</span> Отличия hardlink от symlink</h2>
<div class="outline-text-2" id="text-1">
<dl class="org-dl">
<dt>hardlink</dt><dd>жёсткая ссылка, по сути этот копия того же файла, на который она ссылается.</dd>
<dt>symlink</dt><dd>мягкая ссылка, содержит путь до файла на который она ссылается.</dd>
<dt>inode</dt><dd>объект файловой системы, содержащий информацию о владельце файла, группе, правах доступа, размере, типе, времени модификации (<i>mtime</i>) и доступа к файлу (<i>atime</i>), времени модификации индексного дескриптора (<i>ctime</i>) и счётчик жёстких ссылок на файл. Каждый <i>inode</i> имеет номер, присваиваемый ему файловой системой в момент её создания.</dd>
</dl>
<div class="org-src-container">
<pre class="src src-sh">ls -lih *.org
</pre>
</div>

<pre class="example">
431974 -rw-rw-r-- 1 pimiento pimiento 6,7K Oct 25 23:01 cast.org
448780 -rw-r--r-- 1 pimiento pimiento  19K Oct 25 21:00 c_structures.org
449013 -rw-r--r-- 1 pimiento pimiento 3,3K Oct 25 22:00 c_varargs.org
449015 -rw-r--r-- 1 pimiento pimiento 8,3K Oct 25 22:00 decorators.org
449023 -rw-r--r-- 1 pimiento pimiento 2,8K Oct 25 22:06 fish_rat_or_bird.org
449028 -rw-r--r-- 1 pimiento pimiento  24K Oct 25 23:10 linkers.org
449029 -rw-r--r-- 1 pimiento pimiento 2,5K Oct 25 22:08 pdftk_and_djvu.org
449030 -rw-r--r-- 1 pimiento pimiento 7,9K Oct 25 22:09 processes.org
449032 -rw-r--r-- 1 pimiento pimiento 3,3K Oct 25 22:10 python_collections.org
449034 -rw-r--r-- 1 pimiento pimiento  14K Oct 25 22:10 python_gc.org
449036 -rw-r--r-- 1 pimiento pimiento 8,3K Oct 25 22:10 python_gil.org
449038 -rw-r--r-- 1 pimiento pimiento 5,9K Oct 25 22:11 python_graphs.org
475041 -rw-r--r-- 1 pimiento pimiento   29 Oct 25 17:10 python_logging.org
449040 -rw-r--r-- 1 pimiento pimiento 5,4K Oct 25 22:11 python_os.org
453615 -rw-rw-r-- 1 pimiento pimiento 5,6K Oct 26 00:03 unix_hardlink_symlink.org
</pre>

<p>
Первая колонка отображает номер <i>inode</i>. Далее указаны права доступа, счётчик <i>hardlink</i>-ов на этот файл и т.д.
</p>

<p>
Создадим, например, <span class="underline">жёсткую ссылку</span> на один из файлов:
</p>
<div class="org-src-container">
<pre class="src src-sh">ln unix_hardlink_symlink.org unix_hardlink_symlink.hardlink.org
ls -lih |grep 1700689
</pre>
</div>

<p>
Таким образом счётчик ссылок показывает нам, что один и тот же файл хранится под двумя разными именами.
</p>

<p>
<span class="underline">Мягкая ссылка</span> создаётся с помощью той же команды <b>ln</b>, но с ключом <b>-s</b>:
</p>
<div class="org-src-container">
<pre class="src src-sh">ln -s unix_hardlink_symlink.org unix_hardlink_symlink.symlink.org
ls -lih |grep unix_hardlink_symlink
</pre>
</div>

<pre class="example">
453615 -rw-rw-r-- 2 pimiento pimiento 5,6K Oct 26 00:03 unix_hardlink_symlink.hardlink.org
453617 -rw-rw-r-- 1 pimiento pimiento  18K Oct 26 00:03 unix_hardlink_symlink.html
453615 -rw-rw-r-- 2 pimiento pimiento 5,6K Oct 26 00:03 unix_hardlink_symlink.org
449171 lrwxrwxrwx 1 pimiento pimiento   25 Oct 26 00:03 unix_hardlink_symlink.symlink.org -&gt; unix_hardlink_symlink.org

</pre>

<p>
Мы создали <span class="underline">новый объект файловой системы</span>, который указывает на уже существующий файл. В правах доступа появилось указание что новый объект файловой системы имеет тип <b>l</b> — <i>symbolic link</i>. Необходимо отметить, что inode-номера для оригинального файла и для symlink-а различаются, так как это два независимых файла для файловой системы.
</p>

<p>
<i>hardlink</i> не может указывать на файл в другой ФС, так как <i>inode</i> может принадлежать только одной ФС, <i>symlink</i> — может.
</p>

<p>
При удалении <i>hardlink</i>-а файл будет существовать до тех пор, пока существует хотя бы один <i>hardlink</i> на него, но может менять местоположение, если был удалён оригинальный фал и остался <i>hardlink</i> на него в другом каталоге. При удалении же оригинального файла для <i>symlink</i> — файл-ссылка просто станет нерабочей.
</p>

<p>
С помощью <i>hardlink</i> нельзя создать ссылку на каталог, но можно с помощью <i>symlink</i>.
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -f unix_hardlink_symlink.symlink.org
rm -f unix_hardlink_symlink.hardlink.org
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-26 Thu 00:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
